import "mapbox-gl/dist/mapbox-gl.css";
import "~/styles/index.css";
import "~/styles/mapbox.css";
import "~/components/map-popup/styles.css";

import { useControls } from "leva";
import Map from "~/components/map";

export default function App() {
    const { label } = useControls({
        label: {
            options: {
                "подавался": "подавался",
                "победители": "победители",
                // "доля побед": "доля побед",
                // "2018_подача": "2018_подача",
                // "2019_подача": "2019_подача",
                // "2020_1_подача": "2020_1_подача",
                // "2021_подача": "2021_подача",
                // "2022_1_подача": "2022_1_подача",
                // "2023_подача": "2023_подача",
                // "2024_подача": "2024_подача",
                // "2018_победа": "2018_победа",
                // "2019_победа": "2019_победа",
                // "2020_1_победа": "2020_1_победа",
                // "2021_победа": "2021_победа",
                // "2022_1_победа": "2022_1_победа",
                // "2023_победа": "2023_победа",
                // "2024_победа": "2024_победа",
            },
            value: "победители"
        }
    });

    return <Map
        labelProperty={label}
    />;
}
